app/Http/Controllers/AnimaisController.php

    public function create()
    {
        $sexos = Sexo::get();
        $tamanhos = Tamanho::get();
        $especies = Especie::get();
        $racas = Raca::get();

        return view('projeto.test')->with(compact('sexos','tamanhos','especies','racas'));
---
select * from `sexos` where `sexos`.`deleted_at` is null
select * from `tamanhos` where `tamanhos`.`deleted_at` is null
select * from `especies` where `especies`.`deleted_at` is null
select * from `racas` where `racas`.`deleted_at` is null