app/Http/Controllers/EspecieController.php

    public function index()
    {
<<<<<<< HEAD
<<<<<<< HEAD
        $especies = Especie::all();
        return view('especies.index', compact('especies'));
=======
        return view('projeto.especie');
>>>>>>> main
=======
        $especies = Especie::withCount('raca')->paginate(20);
---
select * from `especies` where `especies`.`deleted_at` is null limit 20 offset 0
select count(*) as aggregate from `especies` where `especies`.`deleted_at` is null