app/Http/Controllers/RacaController.php

select count(*) as aggregate from `racas` where `racas`.`deleted_at` is null
select * from `racas` where `racas`.`deleted_at` is null limit 20 offset 0
---
    public function index()
    {
        $racas = Raca::with('especies')->orderBy('updated_at', 'desc')->paginate(20);
        return view('projeto.racas.raca-index')->with(compact('racas'));

select * from `especies` where `especies`.`deleted_at` is null
---
    public function create()
    {
        $especies = Especie::get();